       IDENTIFICATION DIVISION.
       PROGRAM-ID. PG-INSS.
      * ESTE PROGRAMA CRIA VETORES COM O SALÁRIO LIMITE E CADA ALIQUOTA
      * DO INSS

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
           SELECT IMP-RENDA ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD IMP-RENDA
             LABEL RECORD ARE STANDARD 
             VALUE OF FILE-ID IS "IMPRENDA.DAT".
           
           01 REG-IMPRENDA.
             02 BASE-CALCULO PIC 9(5)V9(2).
             02 ALIQUOTA PIC 9(2)V9(3).
             02 PARCELA-DEDUTIVEL PIC 9(4)V9(2).

       WORKING-STORAGE SECTION.
           01 VEC-IMPRENDA.
             02 VEC-BASE-CALCULO 
             PIC 9(5)V9(2) OCCURS 10 TIMES VALUE ZEROES.

             02 VEC-ALIQUOTA
             PIC 9(2)V9(3) OCCURS 10 TIMES VALUE ZEROES.

             02 VEC-PARCELA-DEDUTIVEL PIC 9(4)V9(2)
             OCCURS 10 TIMES VALUE ZEROES.


           77 FIM PIC 9 VALUE 0.
           77 CONTADOR PIC 9(2) VALUE 1.
       PROCEDURE DIVISION.

       PRINCIPAL.
           PERFORM ABRIR.
           PERFORM LEITURA.
           PERFORM CRIA-TABELA UNTIL FIM EQUAL 1.
           PERFORM FECHAR.
           STOP RUN.

       ABRIR.
          OPEN INPUT IMP-RENDA.
       
       LEITURA.
          READ IMP-RENDA AT END MOVE 1 TO FIM.

       CRIA-TABELA.
          MOVE BASE-CALCULO TO VEC-BASE-CALCULO(CONTADOR).
          MOVE ALIQUOTA TO VEC-ALIQUOTA(CONTADOR).
          MOVE PARCELA-DEDUTIVEL TO VEC-PARCELA-DEDUTIVEL(CONTADOR).
          COMPUTE CONTADOR = CONTADOR + 1.
          PERFORM LEITURA.

       FECHAR.
           CLOSE IMP-RENDA.