       IDENTIFICATION DIVISION.
       PROGRAM-ID. PG-INSS.
      * ESTE PROGRAMA CRIA VETORES COM O SALÁRIO LIMITE E CADA ALIQUOTA
      * DO INSS

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
           SELECT INSS ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD INSS
             LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "INSS.DAT".
           
           01 REG-INSS.
             02 SALARIO PIC 9(5)V99.
             02 ALIQUOTA PIC 9(4)V99.

       WORKING-STORAGE SECTION.
           01 VEC-INSS.
             02 VEC-SALARIO PIC 9(5)V99 OCCURS 10 TIMES VALUE ZEROES.
             02 VEC-ALIQUOTA PIC 9(4)V99 OCCURS 10 TIMES VALUE ZEROES.
           77 FIM PIC 9 VALUE 0.
           77 CONTADOR PIC 9(2) VALUE 1.
       PROCEDURE DIVISION.

       PRINCIPAL.
           PERFORM ABRIR.
           PERFORM LEITURA.
           PERFORM CRIA-TABELA UNTIL FIM EQUAL 1.
           PERFORM FECHAR.
           STOP RUN.
 
       ABRIR.
          OPEN INPUT INSS.
       
       LEITURA.
          READ INSS AT END MOVE 1 TO FIM.

       CRIA-TABELA.
          MOVE SALARIO TO VEC-SALARIO(CONTADOR).
          MOVE ALIQUOTA TO VEC-ALIQUOTA(CONTADOR).
          COMPUTE CONTADOR = CONTADOR + 1.
          PERFORM LEITURA.

       FECHAR.
           CLOSE INSS.